---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElements
source: html/31c4a6fe-3765-4ea2-7437-8bd38be60eec.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElements Property

Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSpaceBoundingElements { get; }
```